results/2018-05-05_17-05-42/post-4k/jetty-server.out
Running 180m test @ http://127.0.0.1:3000/
  3 threads and 500 connections
  Thread calibration: mean lat.: 0.972ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.981ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.973ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.98ms  427.79us  11.32ms   66.35%
    Req/Sec   172.27     91.06   555.00     73.82%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.01ms
 75.000%    1.28ms
 90.000%    1.46ms
 99.000%    2.02ms
 99.900%    2.26ms
 99.990%    5.13ms
 99.999%    6.13ms
100.000%   11.33ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.161     0.000000            1         1.00
       0.382     0.100000       541773         1.11
       0.553     0.200000      1080027         1.25
       0.718     0.300000      1619210         1.43
       0.870     0.400000      2157925         1.67
       1.010     0.500000      2699220         2.00
       1.073     0.550000      2968431         2.22
       1.130     0.600000      3241653         2.50
       1.182     0.650000      3508275         2.86
       1.233     0.700000      3777149         3.33
       1.285     0.750000      4046565         4.00
       1.312     0.775000      4182652         4.44
       1.339     0.800000      4317543         5.00
       1.366     0.825000      4450694         5.71
       1.394     0.850000      4586172         6.67
       1.424     0.875000      4723185         8.00
       1.442     0.887500      4790728         8.89
       1.464     0.900000      4855161        10.00
       1.494     0.912500      4923333        11.43
       1.535     0.925000      4990064        13.33
       1.591     0.937500      5057411        16.00
       1.624     0.943750      5091692        17.78
       1.660     0.950000      5125256        20.00
       1.699     0.956250      5159361        22.86
       1.743     0.962500      5192959        26.67
       1.789     0.968750      5226225        32.00
       1.814     0.971875      5243225        35.56
       1.840     0.975000      5259716        40.00
       1.869     0.978125      5276620        45.71
       1.901     0.981250      5293617        53.33
       1.937     0.984375      5310625        64.00
       1.957     0.985938      5319084        71.11
       1.978     0.987500      5327418        80.00
       2.001     0.989062      5335830        91.43
       2.027     0.990625      5344296       106.67
       2.055     0.992188      5352652       128.00
       2.071     0.992969      5357087       142.22
       2.087     0.993750      5361299       160.00
       2.103     0.994531      5365275       182.86
       2.121     0.995313      5369412       213.33
       2.141     0.996094      5373664       256.00
       2.153     0.996484      5375913       284.44
       2.165     0.996875      5377970       320.00
       2.177     0.997266      5379904       365.71
       2.191     0.997656      5382000       426.67
       2.207     0.998047      5384147       512.00
       2.215     0.998242      5385094       568.89
       2.227     0.998437      5386337       640.00
       2.237     0.998633      5387344       731.43
       2.249     0.998828      5388328       853.33
       2.263     0.999023      5389311      1024.00
       2.273     0.999121      5389913      1137.78
       2.283     0.999219      5390448      1280.00
       2.295     0.999316      5390930      1462.86
       2.311     0.999414      5391460      1706.67
       2.331     0.999512      5391967      2048.00
       2.343     0.999561      5392196      2275.56
       2.363     0.999609      5392472      2560.00
       2.399     0.999658      5392723      2925.71
       2.483     0.999707      5392980      3413.33
       3.813     0.999756      5393241      4096.00
       4.191     0.999780      5393376      4551.11
       4.419     0.999805      5393505      5120.00
       4.623     0.999829      5393637      5851.43
       4.823     0.999854      5393768      6826.67
       4.991     0.999878      5393901      8192.00
       5.079     0.999890      5393967      9102.22
       5.155     0.999902      5394034     10240.00
       5.235     0.999915      5394098     11702.86
       5.315     0.999927      5394164     13653.33
       5.411     0.999939      5394230     16384.00
       5.459     0.999945      5394262     18204.44
       5.507     0.999951      5394295     20480.00
       5.555     0.999957      5394328     23405.71
       5.623     0.999963      5394362     27306.67
       5.703     0.999969      5394395     32768.00
       5.767     0.999973      5394411     36408.89
       5.811     0.999976      5394428     40960.00
       5.855     0.999979      5394443     46811.43
       5.919     0.999982      5394461     54613.33
       5.979     0.999985      5394476     65536.00
       6.003     0.999986      5394485     72817.78
       6.051     0.999988      5394493     81920.00
       6.119     0.999989      5394501     93622.86
       6.163     0.999991      5394510    109226.67
       6.247     0.999992      5394517    131072.00
       6.319     0.999993      5394521    145635.56
       6.367     0.999994      5394526    163840.00
       6.491     0.999995      5394530    187245.71
       6.643     0.999995      5394534    218453.33
       6.755     0.999996      5394538    262144.00
       6.879     0.999997      5394540    291271.11
       6.979     0.999997      5394542    327680.00
       7.051     0.999997      5394544    374491.43
       7.175     0.999998      5394546    436906.67
       7.479     0.999998      5394548    524288.00
       7.675     0.999998      5394549    582542.22
       7.719     0.999998      5394550    655360.00
       8.295     0.999999      5394551    748982.86
       9.679     0.999999      5394552    873813.33
      10.255     0.999999      5394553   1048576.00
      10.311     0.999999      5394554   1165084.44
      10.311     0.999999      5394554   1310720.00
      10.479     0.999999      5394555   1497965.71
      10.479     0.999999      5394555   1747626.67
      10.615     1.000000      5394556   2097152.00
      10.615     1.000000      5394556   2330168.89
      10.615     1.000000      5394556   2621440.00
      10.759     1.000000      5394557   2995931.43
      10.759     1.000000      5394557   3495253.33
      10.759     1.000000      5394557   4194304.00
      10.759     1.000000      5394557   4660337.78
      10.759     1.000000      5394557   5242880.00
      11.327     1.000000      5394558   5991862.86
      11.327     1.000000      5394558          inf
#[Mean    =        0.979, StdDeviation   =        0.428]
#[Max     =       11.320, Total count    =      5394558]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5400039 requests in 180.00m, 607.69MB read
Requests/sec:    500.00
Transfer/sec:     57.62KB